name: "Deeplc_Preprocess_di_amino"
max_batch_size: 1
backend: "python"
input[
 {
   name: 'single_ac',
   data_type: TYPE_FP32,
   dims: [60,6]
 }
]
output [
 {
   name: 'diamino_ac',
   data_type: TYPE_FP32,
   dims: [30,6]
 }
]
