max_batch_size: 1000
platform: "ensemble"
input [
  {
   name: 'peptide_sequences',
   data_type: TYPE_STRING,
   dims: [-1]
  }
]
output [
  {
   name: 'irt',
   data_type: TYPE_FP32,
   dims: [1]
  }
]

ensemble_scheduling {
  step [
    {
      model_name: "Prosit_Preprocess_peptide_no_termini"
      model_version: 1
      input_map {
        key: "peptide_sequences"
        value: "peptide_sequences"
      },
      output_map {
        key: "peptides_in:0"
        value: "peptides_in:0"
      }
    },
    {
      model_name: "Prosit_2024_irt_cit_core"
      model_version: 1
      input_map {
        key: "input_1"
        value: "peptides_in:0"
      },
      output_map {
        key: "output_1"
        value: "irt"
      }
    }
  ]
}
