name: "pfly_2024_fine_tuned"
platform: "tensorflow_savedmodel"
max_batch_size: 128
input [
  {
   name: 'input_1',
   data_type: TYPE_INT64,
   dims: [40]
  }
]
output [
    {
    name: 'output_1'
    data_type: TYPE_FP32
    dims: [4]
    }
]