name: "AlphaPept_Preprocess_charge"
max_batch_size: 7000
backend: "python"
input[
 {
   name: 'charge_raw',
   data_type: TYPE_INT32,
   dims: [1]
 }
]
output [
 {
   name: 'charge_norm',
   data_type: TYPE_FP32,
   dims: [1]
 }
]
