platform: "pytorch_libtorch"
max_batch_size: 7000
input[
  {
   name: 'aa_indices__0',
   data_type: TYPE_INT64,
   dims: [-1]
  },
  {
   name: 'mod_x__1',
   data_type: TYPE_FP32,
   dims: [-1,109],
  }
]
output [
 {
   name: 'output__0',
   data_type: TYPE_FP32,
   dims: [-1],
 }
]
