name: "Deeplc_rt"
max_batch_size: 7000
platform: "tensorflow_savedmodel"

input [
	{
	  name: 'input_137',
	  data_type: TYPE_FP32,
	  dims: [60,6],
	},
	{
	  name: 'input_138',
	  data_type: TYPE_FP32,
	  dims: [30,6],
	},
	{
	  name: 'input_140',
	  data_type: TYPE_FP32,
	  dims: [55],
	},
	{
	  name: 'input_139',
	  data_type: TYPE_FP32,
	  dims: [60,20],
	}
]

output [
  {
   name: 'dense_323',
   data_type: TYPE_FP32,
   dims: [1]
  }
]
