name: "Deeplc_Preprocess_unmod"
max_batch_size: 10
backend: "python"
input[
 {
   name: 'peptides_in_str:0',
   data_type: TYPE_STRING,
   dims: [-1]
 }
]
output [
 {
   name: 'stripped_peptide',
   data_type: TYPE_STRING,
   dims: [-1]
 }
]

instance_group [
    {
      count: 1
      kind: KIND_CPU
    }
]
