name: "modeltorch"
backend: "pytorch"
max_batch_size : 256
input [
  {
    name: "modeltorch_in"
    data_type: TYPE_FP32
    dims: [1]
  }
]
output [
  {
    name: "modeltorch_out"
    data_type: TYPE_FP32
    dims: [1]
  }
]
instance_group [{ kind: KIND_AUTO }]
