name: "Deeplc_Preprocess_peptide_length"
max_batch_size: 1
backend: "python"
input[
 {
   name: 'stripped_peptide',
   data_type: TYPE_STRING,
   dims: [1]
 }
]
output [
 {
   name: 'peptide_length',
   data_type: TYPE_FP32,
   dims: [1]
 }
]
